# Simple Data Cleaning

Data cleaning is the most crucial step in any project, if we do not take care of it properly, it might lead us to a completely different conclusion. Often than not, we might spend half of the time cleaning our data in most projects.

In this notebook, we will discuss some Python functions that can help us in data cleaning especially in:

- Dropping unused column
- Removing duplicate
- Mapping of Data
- Dealing with null data

In [14]:
import pandas as pd
import numpy as np

df = pd.read_csv("titanic_data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,OnboardTime,Unnamed: 13
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,1912-04-10 09:42:47,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,-,1,0,PC 17599,71.2833,C85,C,1912-04-10 09:54:01,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,1912-04-10 09:55:37,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,na,1,0,113803,53.1000,C123,S,1912-04-10 08:06:51,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,1912-04-10 09:10:39,NaN

## Dropping unused column

Based on our observation, there is an invalid/null Unnamed: 13 column that we do not need. We can drop it by using the function below.

In [2]:
df.drop(columns="Unnamed: 13", inplace = True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,OnboardTime
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,1912-04-10 09:42:47
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,-,1,0,PC 17599,71.2833,C85,C,1912-04-10 09:54:01
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,1912-04-10 09:55:37
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,na,1,0,113803,53.1000,C123,S,1912-04-10 08:06:51
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,1912-04-10 09:10:39

## Removing duplicate

In [3]:
df[df.duplicated(keep=False)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,OnboardTime
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.55,C103,S,1912-04-10 08:40:38
18,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.55,C103,S,1912-04-10 08:40:38
29,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.55,C103,S,1912-04-10 08:40:38
55,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29,1,0,2926,26.00,NaN,S,1912-04-10 09:32:51
62,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29,1,0,2926,26.00,NaN,S,1912-04-10 09:32:51
83,81,0,3,"Waelens, Mr. Achille",male,22,0,0,345767,9.00,NaN,S,1912-04-10 09:38:42
97,81,0,3,"Waelens, Mr. Achille",male,22,0,0,345767,9.00,NaN,S,1912-04-10 09:38:42

**keep** allows a few parameters to check on duplicates.

 - first : Mark duplicates as True except for the first occurrence.
 - last : Mark duplicates as True except for the last occurrence.
 - False : Mark all duplicates as True.

In this case, We would like to show all duplicates, so False is passed as the parameter. Now we have seen there are duplicates in this dataset, We would like to remove them and keep the first occurrence. The following function is used to keep the first occurrence.

In [4]:
df = df.drop_duplicates(keep="first")

We can use len(df) or df[df.duplicated(keep=False)] to check if the duplicates are removed. df[df.duplicated(keep=False)] will return null if the duplicates are removed.

In [5]:
df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, OnboardTime]
Index: []

## Mapping of Data

With the help of df["Sex"].unique , we found out that there are other values such as m, m and F exist in this column. This might due to the wrong input from the data source and we have to assume these values are correct and map to male or female.

In [6]:
df["Sex"].unique()

array(['male', 'female', 'm', 'm ', 'M', 'F', 'f'], dtype=object)

In [7]:
df["Sex"] = df["Sex"].map({
    "male": "male",
    "m": "male",
    "m ": "male",
    "M": "male",
    "F": "female",
    "f": "female",
    "female": "female"
})

The function above is used to map those values to male or female.

In [8]:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

## Dealing with Null Values

In the Age column, there are 3 missing values: -, na and NaN. Pandas doesn’t recognize - and na as null. We have to replace them with null before dealing with them.

In [11]:
df["Age"].head(20)

0      22
1       -
2      26
3      na
4      35
5     NaN
6      54
7       2
8     NaN
9      14
10      4
11     58
12     20
13     39
14     14
15     55
16      2
17    NaN
19     31
20    NaN
Name: Age, dtype: object

In [13]:
df["Age"].isnull().head(20)

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8      True
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17     True
19    False
20     True
Name: Age, dtype: bool

**replace()** is used to replace - and na to null.

In [15]:
df['Age'] = df['Age'].replace('-', np.NaN)
df['Age'] = df['Age'].replace('na', np.NaN)
df["Age"].head(10)

0     22
1    NaN
2     26
3    NaN
4     35
5    NaN
6     54
7      2
8    NaN
9     14
Name: Age, dtype: object

Now we have replaced them with null values, what are we going to do with those missing value?

**Solution 01: Drop the Row**

If we are sure about the missing data are not useful or the missing data are only a small portion of the data, we can drop the rows that contain missing values.

If we are confident that this feature (column) does not provide useful information or the missing value percentage is high, we can drop the entire column. This is very useful when doing statistical analysis, since filling in the missing values may yield unexpected or biased results

**Solution 2: Impute the missing values**

It means to calculate the missing values based on other data. For example, we can compute missing values for age with the date of birth.

In this case, we do not have date of birth, we can replace the missing values with the mean or median (mode for categorical value) of the data.

**Note: Mean is most useful when the data is not skewed, while the median is more robust, not sensitive to outliers, and thus used when data is skewed.**

Let’s use median to replace the missing value in this case.

In [18]:
df["Age"] = df["Age"].fillna(df["Age"].median())

In [21]:
df["Age"].isna().sum()

0

df["Age"].median is used to compute the median of the data while fillna is used to replace the missing value with the median.

You can find documentation associated with pre-processing (Standardization, Normalization, Imputation etc.):
https://scikit-learn.org/stable/modules/preprocessing.html